a = 60            # 60 = 0011 1100 
b = 13            # 13 = 0000 1101 
c = 0
 
c = a & b
print ("1 - c 的值为：", c)

c = a | b             
print ("2 - c 的值为：", c)
 
c = a ^ b        
print ("3 - c 的值为：", c)
 
c = ~a           
print ("4 - c 的值为：", c)
 
c = a << 2       
print ("5 - c 的值为：", c)
 
c = a >> 2       
print ("6 - c 的值为：", c)






































# 12 = 0000 1100

# 61 = 0011 1101

# 49 = 0011 0001

# 195 = 1100 0011

# 240 = 1111 0000

# 15 = 0000 1111
